backend/app/Models/Setting.php

select * from `settings` where `name` = 'offline_banks' limit 1
---
    static function getSetting(&$static, $name, $key = null)
    {
        if (!isset($static)) {
            try {
                if (!\Illuminate\Support\Facades\Schema::hasTable('settings')) {
                    $static = null;
                } else {
                    $static = cache()->remember('settings.' . $name, 24 * 60 * 60, function () use ($name) {
                        return self::where('name', $name)->first();
                    });