backend/app/Http/Controllers/Api/Panel/StudentDailyHealthLogController.php

    public function index(Request $request)
    {
        $user = apiAuth();
        if (!$user) {
            return apiResponse2(0, 'unauthorized', trans('auth.unauthorized'));
        }

        $query = StudentDailyHealthLog::with(['user:id,full_name,avatar', 'webinar:id,title'])
            ->orderBy('log_date', 'desc');

        if ($user->isUser()) {
            $query->where('user_id', $user->id);
        } elseif ($user->isTeacher()) {
            $webinarIds = Webinar::where('teacher_id', $user->id)->pluck('id');
            $query->whereIn('webinar_id', $webinarIds);
        }

        if ($request->has('user_id')) {
            $query->where('user_id', (int) $request->user_id);
        }
        if ($request->has('webinar_id')) {
            $query->where('webinar_id', (int) $request->webinar_id);
        }
        if ($request->has('from_date')) {
            $query->where('log_date', '>=', $request->from_date);
        }
        if ($request->has('to_date')) {
            $query->where('log_date', '<=', $request->to_date);
---
select `id`, `full_name`, `avatar` from `users` where `users`.`id` in (1045)

    public function store(Request $request)
    {
        $user = apiAuth();
        if (!$user || !$user->isUser()) {
            return apiResponse2(0, 'unauthorized', trans('auth.unauthorized'));
        }

        $request->validate([
            'log_date' => 'required|date',
            'webinar_id' => 'nullable|exists:webinars,id',
            'water_ml' => 'nullable|integer|min:0',
            'meals' => 'nullable|array',
            'calories' => 'nullable|integer|min:0',
            'protein' => 'nullable|integer|min:0',
            'carbs' => 'nullable|integer|min:0',
            'fat' => 'nullable|integer|min:0',
            'medicines' => 'nullable|string|max:2000',
            'activity_minutes' => 'nullable|integer|min:0',
            'activity_notes' => 'nullable|string|max:500',
            'adherence_score' => 'nullable|integer|min:0|max:100',
            'custom_data' => 'nullable|array',
        ]);

        $logDate = $request->log_date;
        $webinarId = $request->webinar_id ?: null;

        $log = StudentDailyHealthLog::firstOrNew([
            'user_id' => $user->id,
            'webinar_id' => $webinarId,
            'log_date' => $logDate,
        ]);
---
select * from `student_daily_health_logs` where (`user_id` = 1045 and `webinar_id` is null and `log_date` = '2026-02-28') limit 1

    public function show($id)
    {
        $user = apiAuth();
        if (!$user) {
            return apiResponse2(0, 'unauthorized', trans('auth.unauthorized'));
        }

        $log = StudentDailyHealthLog::with(['user:id,full_name,avatar', 'webinar:id,title'])->find($id);
---
select * from `student_daily_health_logs` where `id` = 1 limit 1
select * from `users` where `users`.`id` in (1045)
select * from `webinars` where 0 = 1