backend/app/Http/Controllers/Api/Panel/SummaryController.php

            'earned' => (!empty($nextBadge) and !empty($nextBadge['earned'])) ? $nextBadge['earned']->title : '',
        ];

        $carts = Cart::where('creator_id', $user->id)->count();
        $data['count_cart_items'] = $carts;


        $meetingIds = Meeting::where('creator_id', $user->id)->pluck('id')->toArray();
---
select count(*) as aggregate from `cart` where `creator_id` = 1045
select `id` from `meetings` where `creator_id` = 1045

        $firstDayMonth = strtotime(date('Y-m-01', $time));// First day of the month.
        $lastDayMonth = strtotime(date('Y-m-t', $time));// Last day of the month.

        $monthlySales = Sale::where('seller_id', $user->id)
            ->whereNull('refund_at')
            ->whereBetween('created_at', [$firstDayMonth, $lastDayMonth])
            ->get();
---
select * from `sales` where `seller_id` = 1045 and `refund_at` is null and `created_at` between 1769904000 and 1772236800

        $data['monthlyChart'] = $this->getMonthlySalesOrPurchase($user);

        $webinarsIds = $user->getPurchasedCoursesIds();
        $webinars = Webinar::whereIn('id', $webinarsIds)
            ->where('status', 'active')
            ->get();
        $data['webinarsCount'] = count($webinars);

        $reserveMeetings = ReserveMeeting::where('user_id', $user->id)
            ->whereHas('sale')
            ->where('status', ReserveMeeting::$open)
            ->get();
---
select * from `webinars` where `id` in (2022, 2000, 2010) and `status` = 'active'
select * from `reserve_meetings` where `user_id` = 1045 and exists (select * from `sales` where `reserve_meetings`.`sale_id` = `sales`.`id`) and `status` = 'open'

        } else {


            $supports = Support::where('user_id', $user->id)
                ->whereNotNull('webinar_id')
                ->where('status', 'open')
                ->get();
            $comments = Comment::where('user_id', $user->id)
                ->whereNotNull('webinar_id')
                ->where('status', 'active')
                ->get();
---
select * from `supports` where `user_id` = 1045 and `webinar_id` is not null and `status` = 'open'
select * from `comments` where `user_id` = 1045 and `webinar_id` is not null and `status` = 'active'

    private function getMonthlySalesOrPurchase($user)
    {
        $months = [];
        $data = [];

        // all 12 months
        for ($month = 1; $month <= 12; $month++) {
            $date = Carbon::create(date('Y'), $month);

            $start_date = $date->timestamp;
            $end_date = $date->copy()->endOfMonth()->timestamp;

            $months[] = trans('panel.month_' . $month);

            if (!$user->isUser()) {
                $monthlySales = Sale::where('seller_id', $user->id)
                    ->whereNull('refund_at')
                    ->whereBetween('created_at', [$start_date, $end_date])
                    ->sum('total_amount');

                $data[] = round($monthlySales, 2);
            } else {
                $monthlyPurchase = Sale::where('buyer_id', $user->id)
                    ->whereNull('refund_at')
                    ->whereBetween('created_at', [$start_date, $end_date])
                    ->count();
---
select sum(`total_amount`) as aggregate from `sales` where `seller_id` = 1 and `refund_at` is null and `created_at` between 1767225600 and 1769903999
select count(*) as aggregate from `sales` where `buyer_id` = 1045 and `refund_at` is null and `created_at` between 1767225600 and 1769903999