backend/app/Http/Controllers/Api/Config/ConfigController.php

    public static function get()
    {
        try {
            $registerMethod = getGeneralSettings('register_method') ?? 'email';
            $userLanguages = getGeneralSettings('user_languages');
            if (!empty($userLanguages) and is_array($userLanguages)) {
                $userLanguages = getLanguages($userLanguages);
            } else {
                $userLanguages = [];
            }

            $paymentChannels = [];
            try {
                $paymentChannels = PaymentChannel::all()->groupBy('status');
---
select * from `payment_channels`