backend/app/Helpers/helper.php

select * from `notification_templates` where `id` = '2' limit 1
select * from `notifications` where `user_id` = 1045 and `group_id` is null and `title` = 'new badge' and `message` = '<p>You received Faithful User&nbsp;badge</p>' and `sender` = 'system' and `type` = 'single' limit 1
---
function sendNotification($template, $options, $user_id = null, $group_id = null, $sender = 'system', $type = 'single')
{
    $templateId = getNotificationTemplates($template);
    $notificationTemplate = \App\Models\NotificationTemplate::where('id', $templateId)->first();

    if (!empty($notificationTemplate)) {
        $title = str_replace(array_keys($options), array_values($options), $notificationTemplate->title);
        $message = str_replace(array_keys($options), array_values($options), $notificationTemplate->template);

        $check = \App\Models\Notification::where('user_id', $user_id)
            ->where('group_id', $group_id)
            ->where('title', $title)
            ->where('message', $message)
            ->where('sender', $sender)
            ->where('type', $type)
            ->first();

select * from `navbar_buttons` where `role_id` is null and `for_guest` = 1 limit 1
---
function getNavbarButton($roleId = null, $forGuest = false)
{
    return \App\Models\NavbarButton::where('role_id', $roleId)
        ->where('for_guest', $forGuest)
        ->first();