backend/app/User.php

select sum(`amount`) as aggregate from `accounting` where `user_id` = 1045 and `type_account` = 'income' and `type` = 'deduction' and `system` = 0 and `tax` = 0
---
    public function getIncome()
    {
        $totalIncome = Accounting::where('user_id', $this->id)
            ->where('type_account', Accounting::$income)
            ->where('type', Accounting::$addiction)
            ->where('system', false)
            ->where('tax', false)
            ->sum('amount');

select sum(`amount`) as aggregate from `accounting` where `user_id` = 1045 and `type` = 'addiction' and `system` = 0 and `tax` = 0
select sum(`amount`) as aggregate from `accounting` where `user_id` = 1045 and `type` = 'deduction' and `system` = 0 and `tax` = 0
---
    public function getPayout()
    {
        $credit = Accounting::where('user_id', $this->id)
            ->where('type_account', Accounting::$income)
            ->where('type', Accounting::$addiction)
            ->where('system', false)
            ->where('tax', false)
            ->sum('amount');

        $debit = Accounting::where('user_id', $this->id)
            ->where('type_account', Accounting::$income)
            ->where('type', Accounting::$deduction)
            ->where('system', false)
            ->where('tax', false)
            ->sum('amount');

select * from `notifications` where `user_id` is null and `group_id` is null and `type` = 'students' and not exists (select * from `notifications_status` where `notifications`.`id` = `notifications_status`.`notification_id`) order by `created_at` desc
---
    public function getUnReadNotifications()
    {
        $user = $this;

        $notifications = Notification::where(function ($query) {
            $query->where(function ($query) {
                $query->where('user_id', $this->id)
                    ->where('type', 'single');
            })->orWhere(function ($query) {
                if (!$this->isAdmin()) {
                    $query->whereNull('user_id')
                        ->whereNull('group_id')
                        ->where('type', 'all_users');
                }
            });
        })->doesntHave('notificationStatus')
            ->orderBy('created_at', 'desc')
            ->get();