backend/app/Http/Controllers/Api/Web/WebinarController.php

    public function index()
    {
        $webinars = Webinar::where('webinars.status', 'active')
            ->whereHas('teacher', function ($query) {
                $query->where('status', 'active')
                    ->where(function ($query) {
                        $query->where('ban', false)
                            ->orWhere(function ($query) {
                                $query->whereNotNull('ban_end_at')
                                    ->where('ban_end_at', '<', time());
                            });
                    });
            })
            ->where('private', false)
            ->handleFilters()
            ->get()->map(function ($webinar) {
                return $webinar->brief;
            });
---
select * from `webinars` where `webinars`.`status` = 'active' and exists (select * from `users` where `webinars`.`teacher_id` = `users`.`id` and `status` = 'active' and (`ban` = 0 or (`ban_end_at` is not null and `ban_end_at` < 1772220039))) and `private` = 0 order by `webinars`.`created_at` desc, `webinars`.`updated_at` desc

    public function show($id)
    {
        $webinarsQuery = Webinar::where('status', 'active')
            ->where('private', false)->where('id', $id);

        abort_unless($webinarsQuery->count(), 404);

        $webinars = $webinarsQuery->orderBy('webinars.created_at', 'desc')
            ->orderBy('webinars.updated_at', 'desc')
            ->get()->map(function ($webinar) {
                return $webinar->details;
            })->first();
---
select count(*) as aggregate from `webinars` where `status` = 'active' and `private` = 0 and `id` = '2009'
select * from `webinars` where `status` = 'active' and `private` = 0 and `id` = '2009' order by `webinars`.`created_at` desc, `webinars`.`updated_at` desc

                'textLessons' => function ($query) use ($user) {
                    $query->where('status', WebinarChapter::$chapterActive)
                        ->withCount(['attachments'])
                        ->orderBy('order', 'asc')
                        ->with([
                            'learningStatus' => function ($query) use ($user) {
                                $query->where('user_id', !empty($user) ? $user->id : null);
                            }
                        ]);
                },
                'sessions' => function ($query) use ($user) {
                    $query->where('status', WebinarChapter::$chapterActive)
                        ->orderBy('order', 'asc')
                        ->with([
                            'learningStatus' => function ($query) use ($user) {
                                $query->where('user_id', !empty($user) ? $user->id : null);
                            }
                        ]);
                },
                'assignments' => function ($query) {
                    $query->where('status', WebinarChapter::$chapterActive);
                },
            ])
            ->first();
---
select * from `webinar_chapters` where `webinar_chapters`.`webinar_id` in (2002) and `status` = 'active' order by `order` asc