backend/app/Models/Api/Webinar.php

select * from `faqs` where `faqs`.`webinar_id` = 2009 and `faqs`.`webinar_id` is not null order by `order` asc
select * from `comments` where `comments`.`webinar_id` = 2009 and `comments`.`webinar_id` is not null and `status` = 'active' and `reply_id` is null order by `created_at` desc
select * from `webinar_chapters` where `webinar_chapters`.`webinar_id` = 2009 and `webinar_chapters`.`webinar_id` is not null and exists (select * from `webinar_chapter_items` where `webinar_chapters`.`id` = `webinar_chapter_items`.`chapter_id` and `type` = 'session') and `status` = 'active' order by `order` asc
---
    public function getDetailsAttribute()
    {
        $user = apiAuth();

        $details = [
            'support' => $this->support ? true : false,
            'subscribe' => $this->subscribe ? true : false,
            'description' => $this->description,
            'prerequisites' => $this->prerequisites()
                ->whereHas('prerequisiteWebinar')
                ->orderBy('order', 'asc')
                ->get()
                ->map(function ($prerequisite) {
                    if ($prerequisite->prerequisiteWebinar) {
                        return [
                            'required' => $prerequisite->required,
                            'webinar' => $prerequisite->prerequisiteWebinar->brief ?? null,
                        ];
                    }
                }),
            'faqs' => $this->faqs()->orderBy('order', 'asc')
                ->get()
                ->map(function ($faq) {
                    return $faq->details;
                }),

            'comments' => $this->comments()
                ->where('status', 'active')
                ->whereNull('reply_id')
                ->orderBy('created_at', 'desc')
                ->get()
                ->map(function ($comment) {
                    return $comment->details;

                }),

            'session_chapters' => $this->chapters()
                ->whereHas('chapterItems', function ($query) {
                    $query->where('type', WebinarChapterItem::$chapterSession);
                })
                ->where('status', WebinarChapter::$chapterActive)
                ->orderBy('order', 'asc')
                ->get()
                ->map(function ($chapter) {
                    return $chapter->details;
                }),

select * from `webinar_chapters` where `webinar_chapters`.`webinar_id` = 2009 and `webinar_chapters`.`webinar_id` is not null and exists (select * from `webinar_chapter_items` where `webinar_chapters`.`id` = `webinar_chapter_items`.`chapter_id` and `type` = 'file') and `status` = 'active' order by `order` asc
select * from `files` where `files`.`webinar_id` = 2009 and `files`.`webinar_id` is not null and `status` = 'active' and `chapter_id` is null order by `order` asc
select count(*) as aggregate from `files` where `files`.`webinar_id` = 2009 and `files`.`webinar_id` is not null and `status` = 'active'
---
                    $query->where('type', WebinarChapterItem::$chapterFile);
                })
                ->where('status', WebinarChapter::$chapterActive)
                //     ->where('type', WebinarChapter::$chapterFile)
                ->orderBy('order', 'asc')
                ->get()
                ->map(function ($chapter) {
                    return $chapter->details;
                }),
            'files_without_chapter' => $this->files()
                ->where('status', WebinarChapter::$chapterActive)
                ->orderBy('order', 'asc')
                ->whereNull('chapter_id')
                ->get()
                ->map(function ($file) {
                    return $file->details;
                }),
            'files_count' => $this->files()
                ->where('status', WebinarChapter::$chapterActive)
                ->count(),

select * from `webinar_chapters` where `webinar_chapters`.`webinar_id` = 2009 and `webinar_chapters`.`webinar_id` is not null and exists (select * from `webinar_chapter_items` where `webinar_chapters`.`id` = `webinar_chapter_items`.`chapter_id` and `type` = 'text_lesson') and `status` = 'active'
select * from `text_lessons` where `text_lessons`.`webinar_id` = 2009 and `text_lessons`.`webinar_id` is not null and `status` = 'active' and `chapter_id` is null order by `order` asc
---
                    $query->where('type', WebinarChapterItem::$chapterTextLesson);
                })
                ->where('status', WebinarChapter::$chapterActive)
                //   ->where('type', WebinarChapter::$chapterTextLesson)
                ->get()
                ->map(function ($chapter) {
                    return $chapter->details;
                }),
            'text_lessons_without_chapter' => $this->textLessons()
                ->where('status', WebinarChapter::$chapterActive)
                ->orderBy('order', 'asc')
                ->whereNull('chapter_id')
                ->get()
                ->map(function ($file) {
                    return $file->details;
                }),

select count(*) as aggregate from `webinar_chapters` where `webinar_chapters`.`webinar_id` = 2009 and `webinar_chapters`.`webinar_id` is not null and exists (select * from `webinar_chapter_items` where `webinar_chapters`.`id` = `webinar_chapter_items`.`chapter_id` and `type` = 'text_lesson')
select * from `quizzes` where `quizzes`.`webinar_id` = 2009 and `quizzes`.`webinar_id` is not null and `chapter_id` is null and `status` = 'active'
---
                ->whereHas('chapterItems', function ($query) {
                    $query->where('type', WebinarChapterItem::$chapterTextLesson);
                })
                // ->where('type', WebinarChapter::$chapterTextLesson)
                ->count(),

            'quizzes' => $this->quizzes()
                ->whereNull('chapter_id')
                ->where('status', 'active')
                ->get()
                ->map(function ($quiz) {
                    return $quiz->brief;
                }),

select * from `sales` where `buyer_id` = 1 and `webinar_id` is not null and `type` = 'webinar' and `webinar_id` = 2009 and `refund_at` is null limit 1
---
    public function purchasedDate()
    {
        $user = apiAuth();
        $sale = null;
        if ($user) {
            $sale = Sale::where('buyer_id', $user->id)
                ->whereNotNull('webinar_id')
                ->where('type', 'webinar')
                ->where('webinar_id', $this->id)
                ->whereNull('refund_at')
                ->first();